demo/FSIBeam_interFSIFoam_2206/orignalImp/sub-iter_5/caseTest/fluidDomain/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
//Level 0
    (0 0 0)
    (0.45 0 0)
    (0.55 0 0)
    (1.5 0 0)
    (1.5 0 -0.4)
    (0.55 0 -0.4)
    (0.45 0 -0.4)
    (0 0 -0.4)
    //
    // (0 0 -0.8)
    // (0.45 0 -0.8)
    // (0.55 0 -0.8)
    // (1.5 0 -0.8)
//Level 1
    (0 0.2 0)
    (0.45 0.2 0)
    (0.55 0.2 0)
    (1.5 0.2 0)
    (1.5 0.2 -0.4)
    (0.55 0.2 -0.4)
    (0.45 0.2 -0.4)
    (0 0.2 -0.4)

    // (0 0.2 -0.8)
    // (0.45 0.2 -0.8)
    // (0.55 0.2 -0.8)
    // (1.5 0.2 -0.8)
//Level 2
    (0 0.4 0)
    (0.45 0.4 0)
    (0.55 0.4 0)
    (1.5 0.4 0)
    (1.5 0.4 -0.4)
    (0.55 0.4 -0.4)
    (0.45 0.4 -0.4)
    (0 0.4 -0.4)
    // (0 0.4 -0.8)
    // (0.45 0.4 -0.8)
    // (0.55 0.4 -0.8)
    // (1.5 0.4 -0.8)
);

blocks
(
    hex (0 8 9 1 7 15 14 6) (8 16 8) simpleGrading (1 1 1)
    hex (8 16 17 9 15 23 22 14) (8 16 8) simpleGrading (1 1 1)
    hex (9 17 18 10 14 22 21 13) (8 4 8) simpleGrading (1 1 1)
    hex (10 18 19 11 13 21 20 12) (8 32 8) simpleGrading (1 1 1)
    hex (2 10 11 3 5 13 12 4) (8 32 8) simpleGrading (1 1 1)
//     hex (21 22 34 33 18 17 29 30) (4 8 8) simpleGrading (1 1 1)
//     hex (18 17 29 30 13 14 26 25) (4 8 8) simpleGrading (1 1 1)
//     hex (5 4 16 17 2 3 15 14) (38 8 8) simpleGrading (1 1 1)
//     hex (10 11 23 22 5 4 16 17) (38 8 8) simpleGrading (1 1 1)
//     hex (17 16 28 29 14 15 27 26) (38 8 8) simpleGrading (1 1 1)
//     hex (22 23 35 34 17 16 28 29) (38 8 8) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (7 0 8 15)
        (15 8 16 23)
        // (19 12 24 31)
        // (20 19 31 32)
    )
    patch outlet
    (
        (12 11 3 4)
        (20 19 11 12)
        // (15 16 28 27)
        // (16 23 35 28)
    )
    wall top
    (
        (22 23 16 17)
        (21 22 17 18)
        (20 21 18 19)
        // (26 29 30 25)
        // (28 35 34 29)
        // (27 28 29 26)
    )
    wall bottom
    (
        (0 7 6 1)
        (2 5 4 3)
        // (6 9 10 5)
        // (5 10 11 4)
        // (2 5 4 3)
    )
    wall left
    (
        (7 15 14 6)
        (15 23 22 14)
        (22 21 13 14)
        (21 20 12 13)
        (13 12 4 5)
    )
    symmetryPlane symmetry
    (
        (0 1 9 8)
        (8 9 17 16)
        (9 10 18 17)
        (10 11 19 18)
        (2 3 11 10)
    )
    wall interface
    (
        (1 6 14 9)
        // (6 5 17 18)
        (5 2 10 13)
        (9 14 13 10)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
